{
  "lightning": {
    "id": "001",
    "title": "lightning.gs",
    "summary": "Optimizes and coverts PNG images to Data URIs using the latest HTML5 API technology",
    "details": "<p>Lighnting is a single page website that allows the user to upload an image, optimize it (if PNG) and then create a data URI.</p><p>Technologies used on the client-side include Backbone.js, a JavaScript port of PngCrush and various HTML5 APIs including Web Workers, File and FileReader.</p><p>The site is built on a fluid layout and extensively uses CSS3 transforms, transitions and border-radius to achieve the pop art design homage.</p><p>The code is on <a href=\"https://github.com/TCotton/lightning\" rel=\"external\" class=\"underline\">GitHub</a></p>",
    "code": "Backbone.js",
    "internalUrl": "/#!/side-projects/lightning",
    "externalUrl": "http://lightning.gs/",
    "workImage": "/images/lightning-screenshot.png"
  },
  "pennybooks": {
    "id": "002",
    "title": "Penny Books",
    "summary": "Uses the Amazon API to search for books on sale for only one penny.",
    "details": "<p>Penny Books uses the Amazon API to find books that are on sale for just one penny.</p><p>Technologies used on the server-side include the HTML5 History API, history.js and the jQuery backstretch plugin.</p><p>The site is fully responsive and works and looks great on the mobile, tablet and desktop platforms.</p>",
    "code": "HTML5 APIs and PHP backend",
    "internalUrl": "/#!/side-projects/pennybooks",
    "externalUrl": "http://pennybooks.info/",
    "workImage": "/images/peenybooks-screenshot.png"
  },
  "twttwt": {
    "id": "003",
    "title": "Twt Twt",
    "summary": "Send Tweets with fun UTF-8 character symbols that make a simple message so much more descriptive.",
    "details": "<p>twt twt uses the Twitter API to allow users to insert unicode characters into their Tweets.</p><p>Technologies used include QAuth, jQuery, jQuery Rumble plugin, Modernizr, Selectivizr and SVG.</p>",
    "code": "HTML5 APIs and PHP backend",
    "internalUrl": "/#!/side-projects/twttwt",
    "externalUrl": "https://twttwt.com/",
    "workImage": "/images/twttwt-screenshot.png"
  }
}