{
  "blinkbox": {
    "id": "001",
    "title": "Blinkboxbooks",
    "summary": "Tesco's new flagship eCommerce site built with AngularJS",
    "details": "<p>I worked with a world class in-house team for several months to help build this full-stack JavaScript eBooks website which is intended to be a serious rival to Amazon's UK dominance of the sector.</p><p>My primary responsibility in this project was to provide solutions to the performance problem. At the initial usability tests in November 2013, the website was over 3mb in size and took 22 seconds to load on the Tesco Hudle Android tablet. By January 2014 the size of the homepage had been reduced to 565kb in size and with a load time of under seven seconds on the low-spec Android tablet the Hudle, and load time of just a few seconds on the desktop.</p><p>The website is responsive with a heavy emphasis on visual and functionality polarity between the website and the android and iOS apps.</p>",
    "code": "AngularJS",
    "company": "Blinkboxbooks, Tescos",
    "internalUrl": "/#!/work-projects/blinkbox",
    "externalUrl": "https://www.blinkboxbooks.com/#!/",
    "workImage": "/images/blinkboxbooks-screenshot.png"
  },
  "thomsonreuters": {
    "id": "002",
    "title": "Thomson Reuters Japan",
    "summary": "A key website in Thomson Reuters expanding Far East Market.",
    "details": "<p>I spent several months from 2012 to 2013 working at the Canary Wharf office of Thomson Reuters.</p><p>The company was created after the merger of Thomson Corporation with the Reuters news agency in 2008.</p><p>The company had two large creative services departments in London and in Eagan, Minnesota; with a smaller team at their New York headquarters.</p><p>There was a small web design team in London and whose choice of Content Management System was Wordpress. They considered that this Open Source platform had the right blend of liberal software extendability and user-friendly admin areas.</p><p>Due to the international reach of the company the work often involved liaising between individuals across several different countries. In the case of this project, it meant closely working with the Japanese team who provided text and guidance.</p><p>All coding – CSS, HTML, JavaScript and PHP – was undertaken by myself.</p>",
    "code": "Wordpress",
    "company": "Thomson Reuters",
    "internalUrl": "/#!/work-projects/thomson-reuters-japan",
    "externalUrl": "http://japan.thomsonreuters.com/",
    "workImage": "/images/thomson-reuters-japan-screenshot.png"
  },
  "lawstudent": {
    "id": "003",
    "title": "Thomson Reuters<br> Law Student",
    "summary": "A clean, easy-to-navigate site for Thomson Reuters that is intended to engage university law students.",
    "details": "<p>This project was a refresh of an existing website that had been online for several years.</p><p>The London-based Creative Services web design team were particularly keen on Wordpress because of the ease that non-technical staff could update content.</p><p>Due to its liberal API, Wordpress is best used a framework; which helps to limit the use of third-party plugins. There can be both security and performance concerns when using these plugins so they are best avoided if possible.</p><p>The Thomson Reuters Law Student site is heavily customised so as to achieve the complex layouts. As with the Thomson Reuters Japan site, I was soley responsible for all server-side and client-side development work.</p>",
    "code": "Wordpress",
    "company": "Thomson Reuters",
    "internalUrl": "/#!/work-projects/uk-lawstudent",
    "externalUrl": "http://uklawstudent.thomsonreuters.com/",
    "workImage": "/images/uk-lawstudents-screenshot.png"
  },
  "kaplan": {
    "id": "004",
    "title": "Kaplan International",
    "summary": "Owned by the Washington Post Group, Kaplan International is the worlds leading education provider for those seeking to speak English",
    "details": "<p>Although not a household name, Kaplan International is a multinational corporation with a multi-billion dollar turnover.</p><p>Due to staff sickness, this flagship human resources website had been put to the side for several months. During my time at Kaplan International, I was given the responsibility of working with the human resources team in order to get this project back on track.</p><p>My first task was to refactor all the code and although it is built on Wordpress, it is heavily customised to meet the needs of the department responsible for updating and maintaining the site</p>",
    "code": "Wordpress",
    "company": "Kaplan International",
    "internalUrl": "/#!/work-projects/kaplan",
    "externalUrl": "",
    "workImage": "/images/kaplan-screenshot.png"
  },
  "drnewmans": {
    "id": "005",
    "title": "Dr Drewmans Clinic",
    "summary": "One of Harley Street's leading specialist private clinics.",
    "details": "<p>Working for the Barn Agency, I built this website on the Drupal 7 platform.</p><p>Drupal is a robust Content Management System that if used with key third-party modules such as Views, can create feature rich websites with complex layouts.</p>",
    "code": "Drupal",
    "company": "Barn Agency",
    "internalUrl": "/#!/work-projects/drnewmans",
    "externalUrl": "http://www.drnewmansclinic.co.uk/",
    "workImage": "/images/dr-newmans-screenshot.png"
  }
}